app/controllers/courses_controller.rb

SELECT  "courses".* FROM "courses" WHERE "courses"."id" = $1 LIMIT 1  [["id", 1]]
---
  def edit
    @course=Course.find_by_id(params[:id])

SELECT  "courses".* FROM "courses" WHERE "courses"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "courses" SET "open" = $1, "updated_at" = $2 WHERE "courses"."id" = $3  [["open", "t"], ["updated_at", "2016-11-10 04:19:01.090957"], ["id", 1]]
---
  def open
    @course = Course.find_by_id(params[:id])
    @course.update_attributes(:open=>true)

SELECT  "courses".* FROM "courses" WHERE "courses"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "courses" SET "open" = $1, "updated_at" = $2 WHERE "courses"."id" = $3  [["open", "f"], ["updated_at", "2016-11-10 08:36:36.270855"], ["id", 1]]
---
  def close
    @course = Course.find_by_id(params[:id])
    @course.update_attributes(:open=>false)

SELECT "courses".* FROM "courses"
SELECT "courses".* FROM "courses" INNER JOIN "grades" ON "courses"."id" = "grades"."course_id" WHERE "grades"."user_id" = $1  [["user_id", 36]]
---
  def list
    @course=Course.all
    @course=@course-current_user.courses
    @course_true = Array.new
    @course.each do |single|

SELECT  "courses".* FROM "courses" WHERE "courses"."id" = $1 LIMIT 1  [["id", 1]]
---
  def select
    @course=Course.find_by_id(params[:id])

SELECT  "courses".* FROM "courses" WHERE "courses"."id" = $1 LIMIT 1  [["id", 9]]
---
  def quit
    @course=Course.find_by_id(params[:id])

SELECT "courses".* FROM "courses"
---
  def index
    @course=current_user.teaching_courses if teacher_logged_in?
    @course=current_user.courses if student_logged_in?

    @course_all=Course.all