app/controllers/courses_controller.rb

SELECT  "courses".* FROM "courses" WHERE "courses"."open" = $1 LIMIT 1  [["open", "t"]]
---
  def list
    #-------QiaoCode--------
    @course=Course.where(:open=>true)