app/controllers/grades_controller.rb

SELECT  "grades".* FROM "grades" WHERE "grades"."id" = $1 LIMIT 1  [["id", 1239]]
UPDATE "grades" SET "grade" = $1, "updated_at" = $2 WHERE "grades"."id" = $3  [["grade", 90], ["updated_at", "2016-11-20 04:50:25.843443"], ["id", 1239]]
---
  def update
    @grade=Grade.find_by_id(params[:id])
    if @grade.update_attributes!(:grade => params[:grade][:grade])

SELECT  "courses".* FROM "courses" WHERE "courses"."id" = $1 LIMIT 1  [["id", 1]]
SELECT "grades".* FROM "grades" WHERE "grades"."course_id" = $1  [["course_id", 1]]
---
  def index
    if teacher_logged_in?
      @course=Course.find_by_id(params[:course_id])
      @grades=@course.grades
    elsif student_logged_in?
      @grades=current_user.grades
      @grade_true=Array.new
      @grades.each do |every_grades|