app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 36]]
---
  def edit
    @user=User.find_by(:id => params[:id])